ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_smif_memslot.h
/** \} group_smif_data_structures_memslot */


/**
* \addtogroup group_smif_mem_slot_functions
* \{
*/
cy_en_smif_status_t    Cy_SMIF_Memslot_Init(SMIF_Type *base,
                                cy_stc_smif_block_config_t * const blockConfig,
                                cy_stc_smif_context_t *context);
void        Cy_SMIF_Memslot_DeInit(SMIF_Type *base);
cy_en_smif_status_t    Cy_SMIF_Memslot_CmdWriteEnable( SMIF_Type *base,
                                        cy_stc_smif_mem_config_t const *memDevice,
                                        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_CmdWriteDisable(SMIF_Type *base,
                                         cy_stc_smif_mem_config_t const *memDevice,
                                         cy_stc_smif_context_t const *context);
bool Cy_SMIF_Memslot_IsBusy(SMIF_Type *base, cy_stc_smif_mem_config_t *memDevice,
                                    cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_QuadEnable(SMIF_Type *base,
                                        cy_stc_smif_mem_config_t *memDevice,
                                        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_CmdReadSts(SMIF_Type *base,
                                        cy_stc_smif_mem_config_t const *memDevice,
                                        uint8_t *status, uint8_t command,
                                        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_CmdWriteSts(SMIF_Type *base,
                                        cy_stc_smif_mem_config_t const *memDevice,
                                        void const *status, uint8_t command,
                                        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_CmdChipErase(SMIF_Type *base,
                                        cy_stc_smif_mem_config_t const *memDevice,
                                        cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_CmdSectorErase(SMIF_Type *base,
                                            cy_stc_smif_mem_config_t *memDevice,
                                            uint8_t const *sectorAddr,
                                            cy_stc_smif_context_t const *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_CmdProgram(SMIF_Type *base,
                                    cy_stc_smif_mem_config_t const *memDevice,
                                    uint8_t const *addr,
                                    uint8_t *writeBuff,
                                    uint32_t size,
                                    cy_smif_event_cb_t cmdCmpltCb,
                                    cy_stc_smif_context_t *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_CmdRead(SMIF_Type *base,
                                    cy_stc_smif_mem_config_t const *memDevice,
                                    uint8_t const *addr,
                                    uint8_t *readBuff,
                                    uint32_t size,
                                    cy_smif_event_cb_t cmdCmpltCb,
                                    cy_stc_smif_context_t *context);
cy_en_smif_status_t    Cy_SMIF_Memslot_SfdpDetect(SMIF_Type *base,
                                    cy_stc_smif_mem_device_cfg_t *device,
                                    cy_en_smif_slave_select_t slaveSelect,
                                    cy_en_smif_data_select_t dataSelect,
                                    cy_stc_smif_context_t *context);


/** \} group_smif_mem_slot_functions */


#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSMIF */

#endif /* (CY_SMIF_MEMORYSLOT_H) */


/* [] END OF FILE */
